   # Pandas tutorial
   Pandas is open source,BSD-'licenced library providing high performance, easy to used data structure and data tools for pyhton programing language
   

Agenda
- What is data frame
- What is data series
- Different operation in pandas

In [1]:
import pandas as pd
import numpy as np

In [3]:

df=pd.DataFrame(np.arange(0,20).reshape(5,4),index=['Row1','Row2','Row3','Row4','Row5'],columns=["column1","column2","column3","column4"])

In [4]:
df.head()

      column1  column2  column3  column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [5]:
df.to_csv('Test1.csv')

In [6]:
df.loc['Row1']

column1    0
column2    1
column3    2
column4    3
Name: Row1, dtype: int32

In [7]:
type(df.loc['Row1'])

pandas.core.series.Series

In [ ]:
#Accesing  the element
## 1.  .loc   2. iloc

In [8]:
df.iloc[:,:]

      column1  column2  column3  column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [9]:
df.iloc[0:2,0:2]

      column1  column2
Row1        0        1
Row2        4        5

In [10]:
df.iloc[0:2,0:3]

      column1  column2  column3
Row1        0        1        2
Row2        4        5        6

In [11]:
type(df.iloc[0:2,0:3])

pandas.core.frame.DataFrame

In [12]:
df.iloc[0:2,0]

Row1    0
Row2    4
Name: column1, dtype: int32

In [13]:
type(df.iloc[0:2,0])

pandas.core.series.Series

In [14]:
## take the elements from the column 1
df.iloc[:,1:]

      column2  column3  column4
Row1        1        2        3
Row2        5        6        7
Row3        9       10       11
Row4       13       14       15
Row5       17       18       19

In [15]:
#Convert Dataframe into array

df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [16]:
df.iloc[:,1:].values.shape

(5, 3)

In [17]:
#how to check the null conditions
df.isnull().sum()

column1    0
column2    0
column3    0
column4    0
dtype: int64

In [18]:
df['column1'].value_counts()

0     1
4     1
8     1
12    1
16    1
Name: column1, dtype: int64

In [19]:
df['column1'].unique()

array([ 0,  4,  8, 12, 16])

In [20]:
df['column3']

Row1     2
Row2     6
Row3    10
Row4    14
Row5    18
Name: column3, dtype: int32

In [21]:
type(df['column3'])

pandas.core.series.Series

In [22]:
df[['column3','column4']]    #Use this as a list

      column3  column4
Row1        2        3
Row2        6        7
Row3       10       11
Row4       14       15
Row5       18       19

In [ ]:
df.head()   #gives all the feacture in discribttion
df.info()   #Gives info regarding the dataframe like row and column info
df.describe()   #gives the mathmathical mean std max 25% count infomation not chareter becouse cant take mean of that
#csv file is comma seperatedvalues

In [31]:
test_df=pd.read_csv('Test1.csv')

In [32]:
test_df.head()

  Unnamed: 0  column1  column2  column3  column4
0       Row1        0        1        2        3
1       Row2        4        5        6        7
2       Row3        8        9       10       11
3       Row4       12       13       14       15
4       Row5       16       17       18       19

In [33]:
test1_df=pd.read_csv('Test1.csv',sep=';')

In [34]:
test1_df.head()

  ,column1,column2,column3,column4
0                     Row1,0,1,2,3
1                     Row2,4,5,6,7
2                   Row3,8,9,10,11
3                 Row4,12,13,14,15
4                 Row5,16,17,18,19

# csv

In [35]:
from io import StringIO, BytesIO

In [36]:
data = ('col1,col2,col3\n'
               'x,y,1\n'
               'a,b,2\n'
               'c,d,3')

In [37]:
type(data)

str

In [38]:
StringIO()

In [39]:
pd.read_csv(StringIO(data))

  col1 col2  col3
0    x    y     1
1    a    b     2
2    c    d     3

In [40]:
##Read from specific columns

df=pd.read_csv(StringIO(data), usecols=['col1','col2'])

In [41]:
df

  col1 col2
0    x    y
1    a    b
2    c    d

In [42]:
df.to_csv('Test.csv')

In [43]:
#Specifyinf column data types
data=('a,b,c,d\n'
         '1,2,3,4\n'
         '5,6,7,8\n'
         '9,10,11')

In [44]:
print(data)

a,b,c,d
1,2,3,4
5,6,7,8
9,10,11

In [45]:
type(data)

str

In [49]:
#to do all column now will be an object

df=pd.read.csv(StringIO(data),dtype=object)

AttributeError: module 'pandas' has no attribute 'read'

In [51]:
df=pd.read_csv(StringIO(data),dtype=object)

In [52]:
pd

In [53]:
df

   a   b   c    d
0  1   2   3    4
1  5   6   7    8
2  9  10  11  NaN

In [55]:
df['a']

0    1
1    5
2    9
Name: a, dtype: object

In [56]:
df['a'][1]

'5'

In [57]:
data=('a,b,c,d\n'
         '1,2,3,4\n'
         '5,6,7,8\n'
         '9,10,11')

In [60]:
df=pd.read_csv(StringIO(data),dtype=int)

ValueError: Integer column has NA values in column 3

In [61]:
data=('a,b,c,d\n'
         '1,2,3,4\n'
         '5,6,7,8\n'
         '9,10,11,12')

In [62]:
df=pd.read_csv(StringIO(data),dtype=int)

In [63]:
df

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [65]:
df['a']   #dtype is int32

0    1
1    5
2    9
Name: a, dtype: int32

In [66]:
df=pd.read_csv(StringIO(data),dtype=float)

In [67]:
df

     a     b     c     d
0  1.0   2.0   3.0   4.0
1  5.0   6.0   7.0   8.0
2  9.0  10.0  11.0  12.0

In [68]:
df['a']   #data type is float

0    1.0
1    5.0
2    9.0
Name: a, dtype: float64

In [71]:
df=pd.read_csv(StringIO(data),dtype={'b':int,'c':np.float,'a':'Int64'})

C:\Users\Ajay\AppData\Local\Temp/ipykernel_8116/290331539.py:1: DeprecationWarning: `np.float` is a deprecated alias for the builtin `float`. To silence this warning, use `float` by itself. Doing this will not modify any behavior and is safe. If you specifically wanted the numpy scalar type, use `np.float64` here.
Deprecated in NumPy 1.20; for more details and guidance: https://numpy.org/devdocs/release/1.20.0-notes.html#deprecations
  df=pd.read_csv(StringIO(data),dtype={'b':int,'c':np.float,'a':'Int64'})

In [72]:
df

   a   b     c   d
0  1   2   3.0   4
1  5   6   7.0   8
2  9  10  11.0  12

In [73]:
df['a'][1]

5

In [74]:
type(df['a'][1])

numpy.int64

In [75]:
df.dtypes

a      Int64
b      int32
c    float64
d      int64
dtype: object

In [76]:
## Index column and training delimiters

In [77]:
data=('index,a,b,c\n'
         '4,apple,bat,5.7\n'
         '8,orange,cow,10')

In [78]:
pd.read_csv(StringIO(data))   # this print the bydefold index values

   index       a    b     c
0      4   apple  bat   5.7
1      8  orange  cow  10.0

In [79]:
#want to change the index column

pd.read_csv(StringIO(data),index_col=1)

        index    b     c
a
apple       4  bat   5.7
orange      8  cow  10.0

In [80]:
pd.read_csv(StringIO(data),index_col=0)

            a    b     c
index
4       apple  bat   5.7
8      orange  cow  10.0

In [81]:
data=('a,b,c\n'
         '4,apple,bat,\n'
         '8,orange,cow')

In [83]:
pd.read_csv(StringIO(data))   #since it takinf 4&6 is a index value so to avoid that

        a    b   c
4   apple  bat NaN
8  orange  cow NaN

In [84]:
pd.read_csv(StringIO(data),index_col=False)

   a       b    c
0  4   apple  bat
1  8  orange  cow

In [85]:
##Combining usecols and index col
data=('a,b,c\n'
         '4,apple,bat,\n'
         '8,orange,cow')

In [89]:
pd.read_csv(StringIO(data), usecols=['b','c'],index=False)

TypeError: read_csv() got an unexpected keyword argument 'index'

In [90]:
pd.read_csv(StringIO(data), usecols=['b','c'],index_col=False)

        b    c
0   apple  bat
1  orange  cow

In [91]:
## Quating and charactors, very usefull in NLP
data='a,b\n"Hello, \\"bob\\",nice to see you",5'

In [92]:
pd.read_csv(StringIO(data),escapechar='\\')

                              a  b
0  Hello, "bob",nice to see you  5

In [93]:
df=pd.read_csv('https://download.bls.gov/pub/time.series/cu/cu.item',sep='\t')

In [94]:
df.head()

,item_code,item_name,display_level,selectable,sort_sequence
0,AA0,All items - old base,0,T,2
1,AA0R,Purchasing power of the consumer dollar - old ...,0,T,400
2,SA0,All items,0,T,1
3,SA0E,Energy,1,T,375
4,SA0L1,All items less food,1,T,359